Revit 2025 API
HardwoodImperfectionsType Enumeration
 The enumerated type representing the permitted values for the asset property "HardwoodImperfections" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum HardwoodImperfectionsType
Public Enumeration HardwoodImperfectionsType
public enum class HardwoodImperfectionsType
type HardwoodImperfectionsType
Members
Member name | Value | Description
None | 0
Automatic | 1
Custom | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace